Tutorial/03-counterFlowFlame/constant/TranportCoeffDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      TranCoeff;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

species
(
    H2
    O2
    O
    OH
    H2O
    H
    HO2
    H2O2
    N2
);

H2
{
    fittingTranCoeff
    {
        muCoeffs    (-16.1416 1.00298 -0.0500972 0.00232852);
        kappaCoeffs    (-1.81947 -0.67137 0.145801 -0.00407063);
        DijCoeffs    (
                        (-9.21034 -6.44736e-26 9.25847e-27 -4.40439e-28)
                        (-21.0272 2.54556 -0.119912 0.00537589)
                        (-20.1087 2.28781 -0.0847962 0.00377877)
                        (-20.112 2.28781 -0.0847962 0.00377877)
                        (-26.2965 4.60674 -0.381662 0.016488)
                        (-20.6161 2.77531 -0.150119 0.00670131)
                        (-21.0281 2.54556 -0.119912 0.00537589)
                        (-21.029 2.54556 -0.119912 0.00537589)
                        (-20.8629 2.46383 -0.10894 0.00488439)
                     );
    }
};

O2
{
    fittingTranCoeff
    {
        muCoeffs    (-19.3405 2.62765 -0.265133 0.0118167);
        kappaCoeffs    (-13.7781 3.03034 -0.290604 0.0124347);
        DijCoeffs    (
                        (-21.0272 2.54556 -0.119912 0.00537589)
                        (-9.21034 -6.44736e-26 9.25847e-27 -4.40439e-28)
                        (-23.4324 3.14265 -0.197273 0.00872065)
                        (-23.4526 3.14265 -0.197273 0.00872065)
                        (-30.453 5.60295 -0.492151 0.0205307)
                        (-23.757 3.79558 -0.28044 0.01226)
                        (-24.6597 3.43976 -0.23516 0.0103338)
                        (-24.667 3.43976 -0.23516 0.0103338)
                        (-24.3747 3.3315 -0.221273 0.00973849)
                     );
    }
};

O
{
    fittingTranCoeff
    {
        muCoeffs    (-17.3405 1.90275 -0.170195 0.00767127);
        kappaCoeffs    (-9.7655 1.90275 -0.170195 0.00767127);
        DijCoeffs    (
                        (-20.1087 2.28781 -0.0847962 0.00377877)
                        (-23.4324 3.14265 -0.197273 0.00872065)
                        (-9.21034 -6.44736e-26 9.25847e-27 -4.40439e-28)
                        (-22.376 2.88806 -0.164634 0.00732455)
                        (-28.5983 5.15624 -0.446304 0.0190235)
                        (-22.5257 3.44613 -0.235979 0.010369)
                        (-23.4375 3.14265 -0.197273 0.00872065)
                        (-23.4424 3.14265 -0.197273 0.00872065)
                        (-23.2133 3.04984 -0.185302 0.00820502)
                     );
    }
};

OH
{
    fittingTranCoeff
    {
        muCoeffs    (-17.3099 1.90275 -0.170195 0.00767127);
        kappaCoeffs    (4.12383 -3.89714 0.629982 -0.0280239);
        DijCoeffs    (
                        (-20.112 2.28781 -0.0847962 0.00377877)
                        (-23.4526 3.14265 -0.197273 0.00872065)
                        (-22.376 2.88806 -0.164634 0.00732455)
                        (-9.21034 -6.44736e-26 9.25847e-27 -4.40439e-28)
                        (-28.6142 5.15624 -0.446304 0.0190235)
                        (-22.5274 3.44613 -0.235979 0.010369)
                        (-23.4579 3.14265 -0.197273 0.00872065)
                        (-23.463 3.14265 -0.197273 0.00872065)
                        (-23.2325 3.04984 -0.185302 0.00820502)
                     );
    }
};

H2O
{
    fittingTranCoeff
    {
        muCoeffs    (-12.9653 -1.33484 0.41556 -0.0238812);
        kappaCoeffs    (12.6345 -9.33626 1.58777 -0.0790468);
        DijCoeffs    (
                        (-26.2965 4.60674 -0.381662 0.016488)
                        (-30.453 5.60295 -0.492151 0.0205307)
                        (-28.5983 5.15624 -0.446304 0.0190235)
                        (-28.6142 5.15624 -0.446304 0.0190235)
                        (-9.21034 -6.44736e-26 9.25847e-27 -4.40439e-28)
                        (-28.8579 5.64687 -0.495159 0.0205558)
                        (-29.8961 5.43852 -0.476428 0.02007)
                        (-29.9013 5.43852 -0.476428 0.02007)
                        (-30.2612 5.5433 -0.487098 0.020417)
                     );
    }
};

H
{
    fittingTranCoeff
    {
        muCoeffs    (-22.6578 3.63174 -0.395128 0.0174374);
        kappaCoeffs    (-12.3182 3.63174 -0.395128 0.0174374);
        DijCoeffs    (
                        (-20.6161 2.77531 -0.150119 0.00670131)
                        (-23.757 3.79558 -0.28044 0.01226)
                        (-22.5257 3.44613 -0.235979 0.010369)
                        (-22.5274 3.44613 -0.235979 0.010369)
                        (-28.8579 5.64687 -0.495159 0.0205558)
                        (-9.21034 -6.44736e-26 9.25847e-27 -4.40439e-28)
                        (-23.7574 3.79558 -0.28044 0.01226)
                        (-23.7579 3.79558 -0.28044 0.01226)
                        (-23.4568 3.66173 -0.263264 0.011523)
                     );
    }
};

HO2
{
    fittingTranCoeff
    {
        muCoeffs    (-19.325 2.62765 -0.265133 0.0118167);
        kappaCoeffs    (-13.0051 2.4949 -0.185183 0.00683561);
        DijCoeffs    (
                        (-21.0281 2.54556 -0.119912 0.00537589)
                        (-24.6597 3.43976 -0.23516 0.0103338)
                        (-23.4375 3.14265 -0.197273 0.00872065)
                        (-23.4579 3.14265 -0.197273 0.00872065)
                        (-29.8961 5.43852 -0.476428 0.02007)
                        (-23.7574 3.79558 -0.28044 0.01226)
                        (-9.21034 -6.44736e-26 9.25847e-27 -4.40439e-28)
                        (-24.6749 3.43976 -0.23516 0.0103338)
                        (-24.3819 3.3315 -0.221273 0.00973849)
                     );
    }
};

H2O2
{
    fittingTranCoeff
    {
        muCoeffs    (-19.3099 2.62765 -0.265133 0.0118167);
        kappaCoeffs    (-10.5417 1.29519 0.0223022 -0.00465425);
        DijCoeffs    (
                        (-21.029 2.54556 -0.119912 0.00537589)
                        (-24.667 3.43976 -0.23516 0.0103338)
                        (-23.4424 3.14265 -0.197273 0.00872065)
                        (-23.463 3.14265 -0.197273 0.00872065)
                        (-29.9013 5.43852 -0.476428 0.02007)
                        (-23.7579 3.79558 -0.28044 0.01226)
                        (-24.6749 3.43976 -0.23516 0.0103338)
                        (-9.21034 -6.44736e-26 9.25847e-27 -4.40439e-28)
                        (-24.3887 3.3315 -0.221273 0.00973849)
                     );
    }
};

N2
{
    fittingTranCoeff
    {
        muCoeffs    (-18.7928 2.3564 -0.229683 0.0102714);
        kappaCoeffs    (1.73568 -3.66434 0.664849 -0.0328507);
        DijCoeffs    (
                        (-20.8629 2.46383 -0.10894 0.00488439)
                        (-24.3747 3.3315 -0.221273 0.00973849)
                        (-23.2133 3.04984 -0.185302 0.00820502)
                        (-23.2325 3.04984 -0.185302 0.00820502)
                        (-30.2612 5.5433 -0.487098 0.020417)
                        (-23.4568 3.66173 -0.263264 0.011523)
                        (-24.3819 3.3315 -0.221273 0.00973849)
                        (-24.3887 3.3315 -0.221273 0.00973849)
                        (-9.21034 -6.44736e-26 9.25847e-27 -4.40439e-28)
                     );
    }
};
