Tutorial/03-counterFlowFlame/constant/thermo.FTM
species         9 ( H2 O2 O OH H2O H HO2 H2O2 N2 );

OH
{
    specie
    {
        molWeight       17.00737;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 2.86472886 0.00105650448 -2.59082758e-07 3.05218674e-11 -1.33195876e-15 3683.62875 5.70164073 );
        lowCpCoeffs     ( 4.12530561 -0.00322544939 6.52764691e-06 -5.79853643e-09 2.06237379e-12 3346.30913 -0.69043296 );
    }
    elements
    {
        O               1;
        H               1;
    }
    transport
    {
        muCoeffs        (-17.3099 1.90275 -0.170195 0.00767127);
        kappaCoeffs     (4.12383 -3.89714 0.629982 -0.0280239);
        DijCoeffs       (
                            (-20.112 2.28781 -0.0847962 0.00377877)
                            (-23.4526 3.14265 -0.197273 0.00872065)
                            (-22.376 2.88806 -0.164634 0.00732455)
                            (-9.21034 -6.44736e-26 9.25847e-27 -4.40439e-28)
                            (-28.6142 5.15624 -0.446304 0.0190235)
                            (-22.5274 3.44613 -0.235979 0.010369)
                            (-23.4579 3.14265 -0.197273 0.00872065)
                            (-23.463 3.14265 -0.197273 0.00872065)
                            (-23.2325 3.04984 -0.185302 0.00820502)
        );
    }
}

N2
{
    specie
    {
        molWeight       28.0134;
    }
    thermodynamics
    {
        Tlow            250;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 2.92664 0.001487977 -5.684761e-07 1.009704e-10 -6.753351e-15 -922.7977 5.980528 );
        lowCpCoeffs     ( 3.298677 0.00140824 -3.963222e-06 5.641515e-09 -2.444855e-12 -1020.9 3.950372 );
    }
    elements
    {
        N               2;
    }
    transport
    {
        muCoeffs        (-18.7928 2.3564 -0.229683 0.0102714);
        kappaCoeffs     (1.73568 -3.66434 0.664849 -0.0328507);
        DijCoeffs       (
                            (-20.8629 2.46383 -0.10894 0.00488439)
                            (-24.3747 3.3315 -0.221273 0.00973849)
                            (-23.2133 3.04984 -0.185302 0.00820502)
                            (-23.2325 3.04984 -0.185302 0.00820502)
                            (-30.2612 5.5433 -0.487098 0.020417)
                            (-23.4568 3.66173 -0.263264 0.011523)
                            (-24.3819 3.3315 -0.221273 0.00973849)
                            (-24.3887 3.3315 -0.221273 0.00973849)
                            (-9.21034 -6.44736e-26 9.25847e-27 -4.40439e-28)
        );
    }
}

H2O2
{
    specie
    {
        molWeight       34.01474;
    }
    thermodynamics
    {
        Tlow            250;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 4.573167 0.004336136 -1.474689e-06 2.348904e-10 -1.431654e-14 -18006.96 0.501137 );
        lowCpCoeffs     ( 3.388754 0.006569226 -1.485013e-07 -4.625806e-09 2.471515e-12 -17663.15 6.785363 );
    }
    elements
    {
        H               2;
        O               2;
    }
    transport
    {
        muCoeffs        (-19.3099 2.62765 -0.265133 0.0118167);
        kappaCoeffs     (-10.5417 1.29519 0.0223022 -0.00465425);
        DijCoeffs       (
                            (-21.029 2.54556 -0.119912 0.00537589)
                            (-24.667 3.43976 -0.23516 0.0103338)
                            (-23.4424 3.14265 -0.197273 0.00872065)
                            (-23.463 3.14265 -0.197273 0.00872065)
                            (-29.9013 5.43852 -0.476428 0.02007)
                            (-23.7579 3.79558 -0.28044 0.01226)
                            (-24.6749 3.43976 -0.23516 0.0103338)
                            (-9.21034 -6.44736e-26 9.25847e-27 -4.40439e-28)
                            (-24.3887 3.3315 -0.221273 0.00973849)
        );
    }
}

O2
{
    specie
    {
        molWeight       31.9988;
    }
    thermodynamics
    {
        Tlow            250;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 3.697578 0.0006135197 -1.258842e-07 1.775281e-11 -1.136435e-15 -1233.93 3.189166 );
        lowCpCoeffs     ( 3.212936 0.001127486 -5.75615e-07 1.313877e-09 -8.768554e-13 -1005.249 6.034738 );
    }
    elements
    {
        O               2;
    }
    transport
    {
        muCoeffs        (-19.3405 2.62765 -0.265133 0.0118167);
        kappaCoeffs     (-13.7781 3.03034 -0.290604 0.0124347);
        DijCoeffs       (
                            (-21.0272 2.54556 -0.119912 0.00537589)
                            (-9.21034 -6.44736e-26 9.25847e-27 -4.40439e-28)
                            (-23.4324 3.14265 -0.197273 0.00872065)
                            (-23.4526 3.14265 -0.197273 0.00872065)
                            (-30.453 5.60295 -0.492151 0.0205307)
                            (-23.757 3.79558 -0.28044 0.01226)
                            (-24.6597 3.43976 -0.23516 0.0103338)
                            (-24.667 3.43976 -0.23516 0.0103338)
                            (-24.3747 3.3315 -0.221273 0.00973849)
        );
    }
}

H2
{
    specie
    {
        molWeight       2.01594;
    }
    thermodynamics
    {
        Tlow            250;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 2.991423 0.0007000644 -5.633829e-08 -9.231578e-12 1.582752e-15 -835.034 -1.35511 );
        lowCpCoeffs     ( 3.298124 0.0008249442 -8.143015e-07 -9.475434e-11 4.134872e-13 -1012.521 -3.294094 );
    }
    elements
    {
        H               2;
    }
    transport
    {
        muCoeffs        (-16.1416 1.00298 -0.0500972 0.00232852);
        kappaCoeffs     (-1.81947 -0.67137 0.145801 -0.00407063);
        DijCoeffs       (
                            (-9.21034 -6.44736e-26 9.25847e-27 -4.40439e-28)
                            (-21.0272 2.54556 -0.119912 0.00537589)
                            (-20.1087 2.28781 -0.0847962 0.00377877)
                            (-20.112 2.28781 -0.0847962 0.00377877)
                            (-26.2965 4.60674 -0.381662 0.016488)
                            (-20.6161 2.77531 -0.150119 0.00670131)
                            (-21.0281 2.54556 -0.119912 0.00537589)
                            (-21.029 2.54556 -0.119912 0.00537589)
                            (-20.8629 2.46383 -0.10894 0.00488439)
        );
    }
}

HO2
{
    specie
    {
        molWeight       33.00677;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           3500;
        Tcommon         1000;
        highCpCoeffs    ( 4.0172109 0.00223982013 -6.3365815e-07 1.1424637e-10 -1.07908535e-14 111.856713 3.78510215 );
        lowCpCoeffs     ( 4.30179801 -0.00474912051 2.11582891e-05 -2.42763894e-08 9.29225124e-12 294.80804 3.71666245 );
    }
    elements
    {
        H               1;
        O               2;
    }
    transport
    {
        muCoeffs        (-19.325 2.62765 -0.265133 0.0118167);
        kappaCoeffs     (-13.0051 2.4949 -0.185183 0.00683561);
        DijCoeffs       (
                            (-21.0281 2.54556 -0.119912 0.00537589)
                            (-24.6597 3.43976 -0.23516 0.0103338)
                            (-23.4375 3.14265 -0.197273 0.00872065)
                            (-23.4579 3.14265 -0.197273 0.00872065)
                            (-29.8961 5.43852 -0.476428 0.02007)
                            (-23.7574 3.79558 -0.28044 0.01226)
                            (-9.21034 -6.44736e-26 9.25847e-27 -4.40439e-28)
                            (-24.6749 3.43976 -0.23516 0.0103338)
                            (-24.3819 3.3315 -0.221273 0.00973849)
        );
    }
}

O
{
    specie
    {
        molWeight       15.9994;
    }
    thermodynamics
    {
        Tlow            250;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 2.54206 -2.755062e-05 -3.102803e-09 4.551067e-12 -4.368052e-16 29230.8 4.920308 );
        lowCpCoeffs     ( 2.946429 -0.001638166 2.421032e-06 -1.602843e-09 3.890696e-13 29147.64 2.963995 );
    }
    elements
    {
        O               1;
    }
    transport
    {
        muCoeffs        (-17.3405 1.90275 -0.170195 0.00767127);
        kappaCoeffs     (-9.7655 1.90275 -0.170195 0.00767127);
        DijCoeffs       (
                            (-20.1087 2.28781 -0.0847962 0.00377877)
                            (-23.4324 3.14265 -0.197273 0.00872065)
                            (-9.21034 -6.44736e-26 9.25847e-27 -4.40439e-28)
                            (-22.376 2.88806 -0.164634 0.00732455)
                            (-28.5983 5.15624 -0.446304 0.0190235)
                            (-22.5257 3.44613 -0.235979 0.010369)
                            (-23.4375 3.14265 -0.197273 0.00872065)
                            (-23.4424 3.14265 -0.197273 0.00872065)
                            (-23.2133 3.04984 -0.185302 0.00820502)
        );
    }
}

H2O
{
    specie
    {
        molWeight       18.01534;
    }
    thermodynamics
    {
        Tlow            250;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 2.672146 0.003056293 -8.73026e-07 1.200996e-10 -6.391618e-15 -29899.21 6.862817 );
        lowCpCoeffs     ( 3.386842 0.003474982 -6.354696e-06 6.968581e-09 -2.506588e-12 -30208.11 2.590233 );
    }
    elements
    {
        H               2;
        O               1;
    }
    transport
    {
        muCoeffs        (-12.9653 -1.33484 0.41556 -0.0238812);
        kappaCoeffs     (12.6345 -9.33626 1.58777 -0.0790468);
        DijCoeffs       (
                            (-26.2965 4.60674 -0.381662 0.016488)
                            (-30.453 5.60295 -0.492151 0.0205307)
                            (-28.5983 5.15624 -0.446304 0.0190235)
                            (-28.6142 5.15624 -0.446304 0.0190235)
                            (-9.21034 -6.44736e-26 9.25847e-27 -4.40439e-28)
                            (-28.8579 5.64687 -0.495159 0.0205558)
                            (-29.8961 5.43852 -0.476428 0.02007)
                            (-29.9013 5.43852 -0.476428 0.02007)
                            (-30.2612 5.5433 -0.487098 0.020417)
        );
    }
}

H
{
    specie
    {
        molWeight       1.00797;
    }
    thermodynamics
    {
        Tlow            250;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 2.5 0 0 0 0 25471.63 -0.4601176 );
        lowCpCoeffs     ( 2.5 0 0 0 0 25471.63 -0.4601176 );
    }
    elements
    {
        H               1;
    }
    transport
    {
        muCoeffs        (-22.6578 3.63174 -0.395128 0.0174374);
        kappaCoeffs     (-12.3182 3.63174 -0.395128 0.0174374);
        DijCoeffs       (
                            (-20.6161 2.77531 -0.150119 0.00670131)
                            (-23.757 3.79558 -0.28044 0.01226)
                            (-22.5257 3.44613 -0.235979 0.010369)
                            (-22.5274 3.44613 -0.235979 0.010369)
                            (-28.8579 5.64687 -0.495159 0.0205558)
                            (-9.21034 -6.44736e-26 9.25847e-27 -4.40439e-28)
                            (-23.7574 3.79558 -0.28044 0.01226)
                            (-23.7579 3.79558 -0.28044 0.01226)
                            (-23.4568 3.66173 -0.263264 0.011523)
        );
    }
}
